<?php

return [
    'languages' => [
        'en' => 'Английский',
        'ru' => 'Русский'
    ],
    'webpages' => [
        'home' => [
            'title' => 'Главная',
            'legends' => [
                'legend-1' => [
                    'title' => 'Выгодные цены',
                    'description' => 'Получите мгновенный доступ к тысячам игр по непревзойденным ценам. Наслаждайтесь мгновенной доставкой ключей, обширным выбором игр и упрощенным поиском от надежных продавцов с подлинными отзывами клиентов. Играйте без ограничений - начните свое игровое путешествие сегодня. Мы предоставляем ключи активации игр для ПК по самым конкурентоспособным ценам, закупая их напрямую у официальных поставщиков и издателей, чтобы исключить ненужные наценки и предоставить исключительную ценность.'
                ],
                'legend-2' => [
                    'title' => 'Гарантированное качество',
                    'description' => "Только проверенные ключи от официальных поставщиков. Никаких рисков, никаких сюрпризов - каждая покупка защищена, каждый ключ работает. Вы выбираете - мы гарантируем. Здесь вы найдете огромный выбор игр - от новинок до классики, от популярных AAA тайтлов до редких инди-проектов. Все ключи полностью лицензированы и активируются через официальные методы через Steam, Epic Games, EA App и другие платформы.",
                ],
                'legend-3' => [
                    'title' => 'Море услуг',
                    'description' => "Не ограничивайтесь только одной платформой! Наш сервис предлагает лицензированные ключи активации для всех популярных цифровых магазинов и игровых сервисов. Вы покупаете игры вне Steam? Не проблема - наш каталог включает ключи для всех основных платформ: EA App (ранее Origin), Epic Games Store, GOG.com, PlayStation Network, Xbox Live, Rockstar Games Launcher,
                    Ubisoft Connect и Microsoft Store.",
                ],
            ]
        ],
        'catalog' => [
            'title' => 'Каталог игр'
        ],
        'reviews' => [
            'title' => 'Отзывы'
        ],
        'search' => [
            'title' => 'Найти игру'
        ],
        'cart' => [
            'title' => 'Корзина'
        ],
        'favorite' => [
            'title' => 'Избранное'
        ],
        'login' => [
            'title' => 'Авторизация',
        ],
        'register' => [
            'title' => 'Регистрация',
        ],
    ],
    'navbar' => [
        'home' => 'Главная',
        'catalog' => 'Каталог игр',
        'reviews' => 'Отзывы',
        'search' => 'Найти игру',
        'cart' => 'Корзина',
        'favorite' => 'Избранное',
    ],
    'footer' => [
        'home' => 'Главная',
        'catalog' => 'Каталог игр',
        'reviews' => 'Отзывы',
        'cart' => 'Корзина',
        'account' => 'Мой аккаунт',
        'purchases' => 'Мои покупки',
        'about' => 'О нас',
        'contact' => 'Связаться с нами',
    ],
    'auth' => [
        'account' => [
            'title' => 'Мой профиль',
        ],
        'login' => [
            'title' => 'Авторизация',
            'action' => 'Войти'
        ],
        'register' => [
            'title' => 'Регистрация',
            'action' => 'Зарегистрироваться'
        ],
        'logout' => [
            'title' => 'Выход',
            'action' => 'Выйти'
        ],
        'nickname' => [
            'title' => 'Никнейм',
            'placeholder' => 'Введите ваш никнейм',
        ],
        'email' => [
            'title' => 'Электронная почта',
            'placeholder' => 'Введите вашу электронную почту',
        ],
        'password' => [
            'title' => 'Пароль',
            'placeholder' => 'Введите ваш пароль',
        ],
        'password_confirmation' => [
            'title' => 'Подтверждение пароля',
            'placeholder' => 'Повторите ваш пароль',
        ],
    ],
    'genres' => [
        'all' => 'Все игры',
    ],
    'logo' => [
        'description' => 'Магазин ключей игр',
    ],
    'copyright' => [
        'description' => "Все упомянутые товарные знаки, названия игр и компаний, логотипы,
                материалы являются собственностью соответствующих владельцев."
    ],
];
